module.exports = {
  main: {
    brand: '🍧 История MiniMelts',
    equipment: '⚙️ Виды оборудования',
    contacts: '📩 Контакты',
    conditions: '📝 Условия франшизы',
    order: '🚀 Хочу приобрести франшизу',
    iceCreamType: '🍡 Вкусы мороженого',
  },
  info: {
    advantages: { 
      text: '🏆 Преимущества MiniMelts?', 
      callback_data: 'Преимущества MiniMelts?' 
    },
    makeProcess: { 
      text: '〽️ Процесс изготовления мороженого?', 
      callback_data: 'Процесс изготовления мороженого?' 
    },
  },
  back: 'Назад'
}